function vec=GetDCTCoefficientsVec(A, pos)
% Функция возвращает вектор коэффициентов из массива A, и позицией pos
% в каждом блоке 8x8

	posV = [1	1;	1	2;	2	1;	3	1;	% 4
			2	2;	1	3;	1	4;	2	3;	% 8
			3	2;	4	1;	5	1;	4	2;	% 12
			3	3;	2	4;	1	5;	1	6;	% 16
			2	5;	3	4;	4	3;	5	2;	% 20
			6	1;	7	1;	6	2;	5	3;	% 24
			4	4;	3	5;	2	6;	1	7;	% 28
			1	8;	2	7;	3	6;	4	5;	% 32
			5	4;	6	3;	7	2;	8	1;	% 36
			8	2;	7	3;	6	4;	5	5;	% 40
			4	6;	3	7;	2	8;	3	8;	% 44
			4	7;	5	6;	6	5;	7	4;	% 48
			8	3;	8	4;	7	5;	6	6;	% 52
			5	7;	4	8;	5	8;	6	7;	% 56
			7	6;	8	5;	8	6;	7	7;	% 60
			6	8;	7	8;	8	7;	8	8;];% 64

[height, width]=size(A);
k=1;
vec=zeros(1,(uint16(height*width/64)));
for i=1:8:height-7
	for j=1:8:width-7
		M=A(i:(i+7), j:(j+7));
		ind=posV(pos,:);
		vec(k)=M(ind(1),ind(2));
		k=k+1;
	end
end